---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperature.Dispose
source: html/34ba41ac-dd3f-21f9-5f60-2ebb88f3b48b.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperature.Dispose Method

Releases all resources used by the FluidTemperature

## Syntax (C#)
```csharp
public void Dispose()
```